Catalogs/Лео_СтатьиОборотовРасшифровка/Лео_СтатьиОборотовРасшифровка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Лео_СтатьиОборотовРасшифровка</name>
  <attributes>
    <name>Индекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КодБюджетнойСтатьи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяОборотов</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </attributes>
  <attributes>
    <name>НетИтоговой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
</mdclass:Catalog>

Catalogs/Лео_СтатьиОборотовРасшифровка/ObjectModule.bsl
Процедура ПриКопировании(ОбъектКопирования)
	// Вставить содержимое обработчика.
	
	Наименование = "";
	ЗаполнитьИндекс();
	
	
КонецПроцедуры






Процедура ЗаполнитьИндекс() экспорт 
	
КодСтатьи = СтатьяОборотов.абс_КодБюджетнойСтатьи;
	Индекс = 1;	

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Лео_СтатьиОборотовРасшифровка.Индекс КАК Индекс,
		|	Лео_СтатьиОборотовРасшифровка.абс_КодБюджетнойСтатьи,
		|	Лео_СтатьиОборотовРасшифровка.СтатьяОборотов
		|ИЗ
		|	Справочник.Лео_СтатьиОборотовРасшифровка КАК Лео_СтатьиОборотовРасшифровка
		|ГДЕ
		|	Лео_СтатьиОборотовРасшифровка.СтатьяОборотов = &СтатьяОборотов
		|	И НЕ Лео_СтатьиОборотовРасшифровка.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Индекс УБЫВ";
		
	Запрос.УстановитьПараметр("СтатьяОборотов",СтатьяОборотов);
	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() тогда
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Индекс = Выборка.Индекс + 1;
	КонецЕсли;
	

	абс_КодБюджетнойСтатьи =  КодСтатьи + "_" + сокрлп(Индекс);
	
КонецПроцедуры
